Tekla Open API Reference for Tekla Structures 2025
Operation.GetSimilarNumberedObjects Method
 Gets similar objects based on numbering of given object.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<ModelObject> GetSimilarNumberedObjects(
	ModelObject ObjectToCompare
)
Public Shared Function GetSimilarNumberedObjects (
	ObjectToCompare As ModelObject
) As List(Of ModelObject)
Parameters
ObjectToCompare
Type: Tekla.Structures.Model.ModelObject
The object for comparison.
Return Value
Type: List<ModelObject>
List of similar objects.
Remarks
 This method works currently only with parts and assemblies.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace